//자바스크립트
//다양한 라이브러리와 프레임워크를 사용할 수 있다
//다양한 공개 API를 사용할 수 있다

//자바스크립트 규칙
//1.대소문자를 구별하여 소스를 작성한다.
//2.들여쓰는 습관을 가진다
//3.세미콜론으로 문장을 구분한다.
//4.메모하려면 주석을 이용한다.
//5.식별자는 정해진 규칙을 지켜 작성한다.
//6.예약어는 식별자로 사용할 수 없다.

//내부 자바스크립트
//<body>문 안에 작성한다.
//ex)
//	<body>
//		<script>
//			var name = prompt("이름을 입력하세요");
//			document.write("<b>"+name+"</b>님, 환영합니다.");
//		</script>
//	</body>


//외부 자바스크립트
//1. html파일에 있는 <script>문에 있는 단을 가져와서 .js 파일로 따로 저장한다.
//2. <script src=""></script>를 이용해 연결한다.

//함수
//사용자 입력 값 받기 prompt();
//알림창으로 출력하기 alert();
//웹 브라우저 화면에 출력하기 document.write();
//콘솔에 출력하기 console.log();

//자료형
//컴퓨터가 처리하는 자료의 형태
//1.undefined : 값이 할당되지 않은 상태
//2.null : 할당된 값이 유효하지 않은 상태
//weak datatype check, 미리 변수의 자료형을 지정하지 않음.

//배열
//하나의 변수에 여러 값 저장
//인덱스 0부터 시작

//객체
//여러 자료를 중괄호{}로 묶은 것
//키(key)와 값(value)을 한 쌍으로 여러 자료 저장
